config.org
#+TITLE:My Personal Emacs Config
#+AUTHOR: KISHORE

* Emacs Reference Config i use
https://github.com/seagle0128/.emacs.d?tab=readme-ov-file#manual
https://github.com/Bugswriter/.emacs.d/blob/master/config.org
https://github.com/Bugswriter/BugsWritersEmacs
https://github.com/doomemacs/doomemacs
https://gitlab.com/Clsmith1/dotfiles

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/manual/")
#+end_src

* Appearance
** Theme
this is alagappan 
to set =Theme= you can set via =M-x customize-themes= and 
set and save so the theme will load properly in =emacsclient=
#+BEGIN_SRC emacs-lisp
    (use-package doom-themes
      :if window-system
      :ensure t
      ;; :init (load-theme 'doom-molokai t)
      :config
      (doom-themes-org-config)
      (doom-themes-visual-bell-config)
      (menu-bar-mode -1)
      (tool-bar-mode -1)
      (fringe-mode -1)
      (scroll-bar-mode -1))
    (setq frame-resize-pixelwise t)

    (use-package catppuccin-theme
      :ensure t)
  ;; Load theme
  ;; (load-theme 'doom-one t)

#+END_SRC

** Font
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist
               '(font . "JetBrainsMono Nerd Font-19"))
#+END_SRC
** colorful-mode
#+begin_src emacs-lisp
(use-package colorful-mode
  :ensure t
  :hook (prog-mode text-mode))  
#+end_src

* Madeline
#+BEGIN_SRC emacs-lisp
  (use-package doom-modeline
    :ensure t
    :config
    (display-battery-mode 1)
    (setq doom-modeline-time-icon t)
    (setq doom-modeline-battery t)
    (setq doom-modeline-time t))
;;   :init
;;  (doom-modeline-mode 1))
#+END_SRC

** dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-startup-banner "~/.emacs.d/img/logo.svg")
    (setq dashboard-items '((recents  . 5)
			    (projects . 5)))
    (setq dashboard-banner-logo-title "I am just a coder for fun"))
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
   (setq dashboard-display-icons-p t)
#+END_SRC
* Basic Interface Settings
** Remove lame startup screen
We use an actual replacement for it, keep reading or head directly to dashboard
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
#+END_SRC

*** Disable menus and scroll-bars
If you like using any of those, change =-1= to =1=.
#+BEGIN_SRC emacs-lisp
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
#+END_SRC

*** Disable bell
This is annoying, remove this line if you like being visually reminded of events.
#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
#+END_SRC

*** Set UTF-8 encoding
#+BEGIN_SRC emacs-lisp
  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
#+END_SRC

* window management
#+begin_src emacs-lisp
      (use-package golden-ratio
        :ensure t
        :config
        (golden-ratio-mode 1))
#+end_src
** Functionality
*** Disable backups and auto-saves
I don't use either, you might want to turn those from =nil= to =t= if you do.

#+BEGIN_SRC emacs-lisp
  (setq make-backup-files nil)
  (setq auto-save-default nil)
  (setq create-lockfiles nil)

    ;;  or
      ;; (setq backup-directory-alist
      ;;     '(("." . "~/.emacs.d/.trash"))

      ;;     (setq auto-save-file-name-transforms
      ;; 	    '((".*" "~/.emacs.d/.trash/" t)))
#+END_SRC
*** move text up down
#+begin_src emacs-lisp
  ;;; Move Text
  (use-package move-text
    :ensure t)
  (global-set-key (kbd "M-p") 'move-text-up)
  (global-set-key (kbd "M-n") 'move-text-down)
#+end_src

*** visual-block mode for emacs
#+begin_src emacs-lisp
  ;; (defun ora-ex-point-mark ()
  ;;   (interactive)
  ;;   (if rectangle-mark-mode
  ;;       (exchange-point-and-mark)
  ;;     (let ((mk (mark)))
  ;;       (rectangle-mark-mode 1)
  ;;       (goto-char mk))))

  ;; (defhydra hydra-rectangle (:body-pre (rectangle-mark-mode 1)
  ;;                            :color pink
  ;;                            :post (deactivate-mark))
  ;;   "
  ;;   ^_k_^     _d_elete    _s_tring     |\\     ‗,,,--,,‗
  ;; _h_   _l_   _o_k        _y_ank       /,`.-'`'   .‗  \-;;,‗
  ;;   ^_j_^     _n_ew-copy  _r_eset     |,4-  ) )‗   .;.(  `'-'
  ;;   ^^^^        _e_xchange  _u_ndo     '---''(‗/.‗)-'(‗\‗)
  ;;   ^^^^        ^ ^         _p_aste
  ;;   "
  ;;   ("h" backward-char nil)
  ;;   ("l" forward-char nil)
  ;;   ("k" previous-line nil)
  ;;   ("j" next-line nil)
  ;;   ("e" ora-ex-point-mark nil)
  ;;   ("n" copy-rectangle-as-kill nil)          ;; C-x r M-w
  ;;   ("d" delete-rectangle)                     ;; C-x r d
  ;;   ("r" (if (region-active-p)
  ;;            (deactivate-mark)
  ;;          (rectangle-mark-mode 1)) nil)
  ;;   ("y" yank-rectangle)                       ;; C-x r y
  ;;   ("u" undo nil)
  ;;   ("s" string-rectangle)                     ;; C-x r t
  ;;   ("p" kill-rectangle nil)                   ;; C-x r k
  ;;   ("o" open-rectangle)                       ;; C-x r o
  ;;   ("c" clear-rectangle)                      ;; C-x r c
  ;;   ("N" rectangle-number-lines))              ;; C-x r N

    ;; ;; (global-set-key (kbd "C-x SPC") 'hydra-rectangle/body)
#+end_src

*** word wrap
#+begin_src emacs-lisp
(global-visual-line-mode t)
#+end_src
*** World clock
#+begin_src emacs-lisp
  (setq world-clock-list
        '(
  	("Australia/Melbourne" "Melbourne")
  	("Asia/kolkata" "India")
  	("America/Chicago" "Chicago")
  	("Asia/Kathmandu" "Kathmandu")
  	("Etc/UTC" "UTC")))

  (setq world-clock-time-format "%a, %d %b %I:%M %p %Z")
#+end_src
*** Change yes-or-no questions into y-or-n questions

#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
+*** optionla of you use consult-buffer 
*** recent-files
#+BEGIN_SRC emacs-lisp
(use-package recentf
  :init
  (setq
    recentf-save-file "~/.emacs.d/.cache/recentf"
    recentf-max-saved-items 10000
    recentf-max-menu-items 5000
    )
  (recentf-mode 1)
  (run-at-time nil (* 5 60) 'recentf-save-list)
)
#+END_SRC

*** On relative line numbers
#+BEGIN_SRC emacs-lisp
      ;; (setq display-line-numbers-type 'relative)
      ;; (setq display-line-numbers-mode)

    (setq display-line-numbers-type 'relative)  ;; Use 't for absolute numbers
      (global-display-line-numbers-mode 1)

  ;; of in mode only
  (add-hook 'org-mode-hook (lambda () (display-line-numbers-mode -1)))

        ;; off
        ;; (setq display-line-numbers-type nil)
#+END_SRC
*** sudo edit
#+begin_src emacs-lisp
  (use-package sudo-edit
  :ensure t
  :bind ("C-c C-0" . sudo-edit))
#+end_src

*** Remembering the last place you visited in a file
Sometimes it’s convenient for Emacs to remember the last location you were at when you visited a particular file. The save-place-mode can help with that!

Once you turn on this mode, Emacs will drop your cursor to the last visited location in any file that you open.
#+begin_src elisp
;; Remember and restore the last cursor location of opened files
(save-place-mode 1)
#+end_src

*** Prevent using UI dialog's for prompts
Emacs will show prompts to confirm many different types of actions, and for some of them it shows a graphical dialog box. If you prefer to keep your Emacs workflow more keyboard-focused, you can turn off those dialog box prompts with this setting:
#+begin_src elisp
;; Don't pop up UI dialogs when prompting
(setq use-dialog-box nil)
#+end_src

** Automatically revert buffers for changed files
One thing that can be annoying about Emacs when you first start using it is that it doesn’t automatically refresh file buffers when the file on disk has been changed outside of Emacs. This can often happen when you’re using tools that generate some kind of text file output that you need to read in an Emacs buffer.

The global-auto-revert-mode will make Emacs watch the files for all open buffers for changes on disk and it will automatically refresh those buffers if they don’t have unsaved changes!
#+begin_src elisp
;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)
#+end_src
I also like adding the following setting to cause other types of buffers in Emacs to update when related files on disk have changed.

The place this is most useful is when you’re using Emacs’ excellent Dired package! The following setting will cause Dired buffers to be automatically refreshed when files get added or deleted from the directory you are browsing:
#+begin_src elisp
;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)
#+end_src

** Cool Icons
=M-x= nerd-icons-install-fonts 
#+BEGIN_SRC emacs-lisp
    (use-package all-the-icons
      :ensure t
      :init)
    ;; (use-package treemacs-icons-dired
    ;;   :ensure t
    ;;   :if (display-graphic-p)
    ;;   :config (treemacs-icons-dired-mode))

    (use-package all-the-icons-ibuffer
      :ensure t
      :init (all-the-icons-ibuffer-mode 1))
#+END_SRC

** copy current line to the clipboard
#+BEGIN_SRC emacs-lisp
(defun my-line-save ()
  (interactive)
  (let ((l (substring (thing-at-point 'line) 0 -1)))
    (kill-new l)
    (message "saved : %s" l)))
(local-set-key (kbd "C-c w") #'my-line-save)
#+END_SRC

