config.el
(use-package doom-themes
    :if window-system
    :ensure t
    ;; :init (load-theme 'doom-molokai t)
    :config
    (doom-themes-org-config)
    (doom-themes-visual-bell-config)
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (fringe-mode -1)
    (scroll-bar-mode -1))
  (setq frame-resize-pixelwise t)

  (use-package catppuccin-theme
    :ensure t)
;; Load theme
;; (load-theme 'doom-one t)

(add-to-list 'default-frame-alist
             '(font . "JetBrainsMono Nerd Font-19"))

(use-package colorful-mode
  :ensure t
  :hook (prog-mode text-mode))

(use-package doom-modeline
  :ensure t
  :config
  (display-battery-mode 1)
  (setq doom-modeline-time-icon t)
  (setq doom-modeline-battery t)
  (setq doom-modeline-time t)
  :init
  (doom-modeline-mode 1))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner "~/.emacs.d/img/logo.svg")
  (setq dashboard-items '((recents  . 5)
			    (projects . 5)))
  (setq dashboard-banner-logo-title "I am just a coder for fun"))
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
 (setq dashboard-display-icons-p t)

(setq inhibit-startup-message t)

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

(setq ring-bell-function 'ignore)

(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

(use-package golden-ratio
  :ensure t
  :config
  (golden-ratio-mode 1))

(setq make-backup-files nil)
(setq auto-save-default nil)
(setq create-lockfiles nil)

  ;;  or
    ;; (setq backup-directory-alist
    ;;     '(("." . "~/.emacs.d/.trash"))

    ;;     (setq auto-save-file-name-transforms
    ;; 	    '((".*" "~/.emacs.d/.trash/" t)))

(setq world-clock-list
      '(
	("Australia/Melbourne" "Melbourne")
	("Asia/kolkata" "India")
	("America/Chicago" "Chicago")
	("Asia/Kathmandu" "Kathmandu")
	("Etc/UTC" "UTC")))

(setq world-clock-time-format "%a, %d %b %I:%M %p %Z")

(defalias 'yes-or-no-p 'y-or-n-p)

(use-package recentf
  :init
  (setq
    recentf-save-file "~/.emacs.d/.cache/recentf"
    recentf-max-saved-items 10000
    recentf-max-menu-items 5000
    )
  (recentf-mode 1)
  (run-at-time nil (* 5 60) 'recentf-save-list)
)

;; (setq display-line-numbers-type 'relative)
    ;; (setq display-line-numbers-mode)

  (setq display-line-numbers-type 'relative)  ;; Use 't for absolute numbers
    (global-display-line-numbers-mode 1)

;; of in mode only
(add-hook 'org-mode-hook (lambda () (display-line-numbers-mode -1)))

      ;; off
      ;; (setq display-line-numbers-type nil)

(use-package sudo-edit
:ensure t
:bind ("C-c C-0" . sudo-edit))

;; Remember and restore the last cursor location of opened files
(save-place-mode 1)

;; Don't pop up UI dialogs when prompting
(setq use-dialog-box nil)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

(use-package all-the-icons
  :ensure t
  :init)
;; (use-package treemacs-icons-dired
;;   :ensure t
;;   :if (display-graphic-p)
;;   :config (treemacs-icons-dired-mode))

(use-package all-the-icons-ibuffer
  :ensure t
  :init (all-the-icons-ibuffer-mode 1))

(defun my-line-save ()
  (interactive)
  (let ((l (substring (thing-at-point 'line) 0 -1)))
    (kill-new l)
    (message "saved : %s" l)))
(local-set-key (kbd "C-c w") #'my-line-save)
