config.org
* Dired 
#+begin_src emacs-lisp
  ;; (use-package dired
  ;;   :ensure nil
  ;;   :config
  ;;   ;; (setq insert-directory-program "exa")  ;; or "exa" if you prefer that
  ;;   (setq dired-listing-switches "--color=auto -alh")) ;; Adjust flags as needed


  (use-package all-the-icons
    :ensure t)
  ;; Directory operations
  (use-package dired
    :ensure nil
    :bind (:map dired-mode-map
                ("C-c C-p" . wdired-change-to-wdired-mode))
    :config
    ;; Guess a default target directory
    (setq dired-dwim-target t)

    ;; Always delete and copy recursively
    (setq dired-recursive-deletes 'always
          dired-recursive-copies 'always)

    ;; Show directory first
    (setq dired-listing-switches "-alh --group-directories-first"))

    ;; Quick sort dired buffers via hydra
    (use-package dired-quick-sort
      :ensure t
      :bind (:map dired-mode-map
    		("S" . hydra-dired-quick-sort/body)))

    ;; Show git info in dired
    (use-package dired-git-info
      :ensure t
      :bind (:map dired-mode-map
    		(")" . dired-git-info-mode)))

    ;; Allow rsync from dired buffers
    (use-package dired-rsync
      :ensure t
      :bind (:map dired-mode-map
    		("C-c C-r" . dired-rsync)))

    ;; Colorful dired
;;    (use-package diredfl
;;      :ensure t
;;      :hook (dired-mode . diredfl-mode))

    (use-package nerd-icons-dired
      :ensure t
      :diminish
      :if (featurep 'all-the-icons)
      :custom-face
      (nerd-icons-dired-dir-face ((t (:inherit nerd-icons-dsilver :foreground unspecified))))
      :hook (dired-mode . nerd-icons-dired-mode))


(use-package dired-aux
  :demand t)

(use-package dired-x
  :demand t
  :config
  (let ((cmd (cond ((eq system-type 'darwin) "open")   ;; macOS
                   ((eq system-type 'gnu/linux) "xdg-open")   ;; Linux
                   ((eq system-type 'windows-nt) "start")   ;; Windows
                   (t ""))))  ;; Default to empty for unknown OS
    (setq dired-guess-shell-alist-user
          `(("\\.pdf\\'" ,cmd)
            ("\\.docx\\'" ,cmd)
            ("\\.\\(?:djvu\\|eps\\)\\'" ,cmd)
            ("\\.\\(?:jpg\\|jpeg\\|png\\|gif\\|xpm\\)\\'" ,cmd)
            ("\\.\\(?:xcf\\)\\'" ,cmd)
            ("\\.csv\\'" ,cmd)
            ("\\.tex\\'" ,cmd)
            ("\\.\\(?:mp4\\|mkv\\|avi\\|flv\\|rm\\|rmvb\\|ogv\\)\\(?:\\.part\\)?\\'" ,cmd)
            ("\\.\\(?:mp3\\|flac\\)\\'" ,cmd)
            ("\\.html?\\'" ,cmd)
            ("\\.md\\'" ,cmd)))))

    ;; `find-dired' alternative using `fd'
    (when (executable-find "fd")
      (use-package fd-dired))
#+end_src
** Completion
*** vertigo
#+BEGIN_SRC emacs-lisp
    ;; Enable vertico
   (use-package compat
     :ensure t)

  (use-package vertico
    :ensure t
    :custom
    ;; (vertico-scroll-margin 0) ;; Different scroll margin
    ;; (vertico-count 20) ;; Show more candidates
    (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
    ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
    :init
    (vertico-mode))

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :ensure t
    :init
    (savehist-mode))

  ;; A few more useful configurations...
  (use-package emacs
    :ensure t
    :custom
    ;; Support opening new minibuffers from inside existing minibuffers.
    (enable-recursive-minibuffers t)
    ;; Hide commands in M-x which do not work in the current mode.  Vertico
    ;; commands are hidden in normal buffers. This setting is useful beyond
    ;; Vertico.
    (read-extended-command-predicate #'command-completion-default-include-p)
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
		    (replace-regexp-in-string
		     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
		     crm-separator)
		    (car args))
	    (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
	  '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode))

  (setq read-file-name-completion-ignore-case t
	read-buffer-completion-ignore-case t
	completion-ignore-case t)
#+END_SRC
*** marginalia
just show mode good stuff in vertigo
#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :config
     (marginalia-mode 1))
#+end_src
*** orderless
I recommend to give Orderless completion a try, which is more flexible and powerful than the default completion styles.
#+BEGIN_SRC emacs-lisp
  ;; Optionally use the `orderless' completion style.
  (use-package orderless
    :ensure t
    :custom
    ;; Configure a custom style dispatcher (see the Consult wiki)
    ;; (orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch))
    ;; (orderless-component-separator #'orderless-escapable-split-on-space)
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))
#+END_SRC

*** ido-mode
do not touch it will mess up vertigo *comp* ex C-x b
#+BEGIN_SRC emacs-lisp
;;  (ido-mode 1)
;;  (setq ido-separator "\n")
#+END_SRC

*** corfu compilation for org roam node auto-complete
- [[https://github.com/minad/corfu]]
#+begin_src emacs-lisp
    (use-package corfu
      :ensure t
      :custom
      (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
      (corfu-auto t)                 ;; Enable auto completion
      ;; (corfu-separator ?\s)          ;; Orderless field separator
      ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
      (corfu-quit-no-match 'separator)      ;; Never quit, even if there is no match
      ;; (corfu-preview-current nil)    ;; Disable current candidate preview
      ;; (corfu-elect 'prompt)      ;; Preselect the prompt
      ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
      ;; (corfu-scroll-margin 5)        ;; Use scroll margin

      ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
      ;; :hook ((prog-mode . corfu-mode)
      ;;        (shell-mode . corfu-mode)
      ;;        (eshell-mode . corfu-mode))

      ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
      ;; be used globally (M-/).  See also the customization variable
      ;; `global-corfu-modes' to exclude certain modes.
      :init
      (global-corfu-mode))

    (use-package emacs
      :ensure t
      :custom
      (tab-always-indent 'complete)
      (text-mode-ispell-word-completion nil)
      (read-extended-command-predicate #'command-completion-default-include-p))
#+end_src
