config.org
*** consult-ripgrep
#+begin_src emacs-lisp
    ;; Example configuration for Consult
  (use-package consult
    :ensure t
    ;; Replace bindings. Lazily loaded by `use-package'.
    :bind (;; C-c bindings in `mode-specific-map'
  	   ("C-c M-x" . consult-mode-command)
  	   ("C-c h" . consult-history)
  	   ("C-c k" . consult-kmacro)
  	   ("C-c m" . consult-man)
  	   ("C-c i" . consult-info)
  	   ([remap Info-search] . consult-info)
  	   ;; C-x bindings in `ctl-x-map'
  	   ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
  	   ;; ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
  	   ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
  	   ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
  	   ("C-x t b" . consult-buffer-other-tab)    ;; orig. switch-to-buffer-other-tab
  	   ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
  	   ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
  	   ;; Custom M-# bindings for fast register access
  	   ("M-#" . consult-register-load)
  	   ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
  	   ("C-M-#" . consult-register)
  	   ;; Other custom bindings
  	   ("M-y" . consult-yank-pop)                ;; orig. yank-pop
  	   ;; M-g bindings in `goto-map'
  	   ("M-g e" . consult-compile-error)
  	   ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
  	   ("M-g g" . consult-goto-line)             ;; orig. goto-line
  	   ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
  	   ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
  	   ("M-g m" . consult-mark)
  	   ("M-g k" . consult-global-mark)
  	   ("M-g i" . consult-imenu)
  	   ("M-g I" . consult-imenu-multi)
  	   ;; M-s bindings in `search-map'
  	   ("M-s d" . consult-find)                  ;; Alternative: consult-fd
  	   ("M-s c" . consult-locate)
  	   ("M-s g" . consult-grep)
  	   ("M-s G" . consult-git-grep)
  	   ("M-s r" . consult-ripgrep)
  	   ("M-s l" . consult-line)
  	   ("M-s L" . consult-line-multi)
  	   ("M-s k" . consult-keep-lines)
  	   ("M-s u" . consult-focus-lines)
  	   ;; Isearch integration
  	   ("M-s e" . consult-isearch-history)
  	   :map isearch-mode-map
  	   ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
  	   ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
  	   ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
  	   ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
  	   ;; Minibuffer history
  	   :map minibuffer-local-map
  	   ("M-s" . consult-history)                 ;; orig. next-matching-history-element
  	   ("M-r" . consult-history))                ;; orig. previous-matching-history-element

    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)

    ;; The :init configuration is always executed (Not lazy)
    :init

    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
  	  register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
  	  xref-show-definitions-function #'consult-xref)

    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config
    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key "M-.")
    ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     consult--source-bookmark consult--source-file-register
     consult--source-recent-file consult--source-project-recent-file
     ;; :preview-key "M-."
     :preview-key '(:debounce 0.4 any))

    ;; Optionally configure the narrowing key.
    ;; Both < and C-+ work reasonably well.
    (setq consult-narrow-key "<") ;; "C-+"

    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    ;; (keymap-set consult-narrow-map (concat consult-narrow-key " ?") #'consult-narrow-help)
  )
#+end_src
** which-key
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :config
    (which-key-mode))



#+END_SRC

** embark
#+begin_src emacs-lisp
(use-package embark
  :ensure t
  :bind
  (("C-." . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

  :init

  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
#+end_src
** VTerm
| Command                      | Description                                     |
|------------------------------+-------------------------------------------------|
| =multi-vterm=                  | Create new terminal                             |
| =multi-vterm-next=             | Switch to next terminal                         |
| =multi-vterm-prev=             | Switch to previous terminal                     |
| =multi-vterm-dedicated-toggle= | Toggle dedicated terminal                       |
| =multi-vterm-project=          | Create/toggle terminal based on current project |

#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :ensure t
    :init)
  (setq vterm-shell "/usr/bin/fish")  ;; Adjust the path to fish if necessary
   ;; (setq vterm-shell "/usr/bin/bash")

  (use-package multi-vterm
    :ensure t
    :init
    (global-set-key (kbd "<M-return>") 'multi-vterm))
#+END_SRC

** ibuffer
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (setq ibuffer-expert t)
#+END_SRC

** undo-tree vundo
#+BEGIN_SRC emacs-lisp
  (use-package vundo
    :commands (vundo)
    :ensure t
    :config
    ;; Take less on-screen space.
    (setq vundo-compact-display t)

    ;; Better contrasting highlight.
    (custom-set-faces
      '(vundo-node ((t (:foreground "#808080"))))
      '(vundo-stem ((t (:foreground "#808080"))))
      '(vundo-highlight ((t (:foreground "#FFFF00")))))

    ;; Use `HJKL` VIM-like motion, also Home/End to jump around.
    (define-key vundo-mode-map (kbd "l") #'vundo-forward)
    (define-key vundo-mode-map (kbd "<right>") #'vundo-forward)
    (define-key vundo-mode-map (kbd "h") #'vundo-backward)
    (define-key vundo-mode-map (kbd "<left>") #'vundo-backward)
    (define-key vundo-mode-map (kbd "j") #'vundo-next)
    (define-key vundo-mode-map (kbd "<down>") #'vundo-next)
    (define-key vundo-mode-map (kbd "k") #'vundo-previous)
    (define-key vundo-mode-map (kbd "<up>") #'vundo-previous)
    (define-key vundo-mode-map (kbd "<home>") #'vundo-stem-root)
    (define-key vundo-mode-map (kbd "<end>") #'vundo-stem-end)
    (define-key vundo-mode-map (kbd "q") #'vundo-quit)
    (define-key vundo-mode-map (kbd "C-g") #'vundo-quit)
    (define-key vundo-mode-map (kbd "RET") #'vundo-confirm))

  (with-eval-after-load 'evil
    (evil-define-key 'normal 'global (kbd "C-M-u") 'vundo))

  (global-set-key (kbd "C-x u") 'vundo)
#+END_SRC

