config.org
** multiple cursors
#+BEGIN_SRC emacs-lisp
  ;; (use-package multiple-cursors
  ;;   :ensure t)
  ;; (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  ;; (global-set-key (kbd "C->")         'mc/mark-next-like-this)
  ;; (global-set-key (kbd "C-<")         'mc/mark-previous-like-this)
  ;; (global-set-key (kbd "C-c C-<")     'mc/mark-all-like-this)
  ;; (global-set-key (kbd "C-\"")        'mc/skip-to-next-like-this)
  ;; (global-set-key (kbd "C-:")         'mc/skip-to-previous-like-this)
  (global-set-key (kbd "C-c v")         'set-rectangular-region-anchor)
#+END_SRC
* key-map
#+BEGIN_SRC emacs-lisp
      ;; Bind `previous-buffer` globally
      ;; Bind `next-buffer` globally
      (global-set-key [mouse-9] #'next-buffer)
      (global-set-key [mouse-8] #'previous-buffer)
    ;; (global-set-key (kbd "M-.") 'next-buffer)
    ;; (global-set-key (kbd "M-,") 'previous-buffer)-

  (global-set-key (kbd "M-1") 'previous-buffer)
  (global-set-key (kbd "M-2") 'next-buffer)

      ;; remap redo from C-M-_ to  C-x U 
      (global-set-key (kbd "C-x U") 'undo-redo)

      ;; Visiting the configuration
      (defun config-visit ()
        (interactive)
        (find-file "~/.emacs.d/config.org"))
      (global-set-key (kbd "C-c e") 'config-visit)

      ;; Toggle maximize buffer
      (defun toggle-maximize-buffer () "Maximize buffer"
             (interactive)
             (if (= 1 (length (window-list)))
        	   (jump-to-register '_)
        	 (progn
        	   (set-register '_ (list (current-window-configuration)))
        	   (delete-other-windows))))
      (global-set-key [(super shift return)] 'toggle-maximize-buffer) 

      ;;Always murder current buffer
      (defun kill-curr-buffer ()
        (interactive)
        (kill-buffer (current-buffer)))
      (global-set-key (kbd "C-x k") 'kill-curr-buffer)

      ;;  Kill whole word
      (defun kill-whole-word ()
        (interactive)
        (backward-word)
        (kill-word 1))
      (global-set-key (kbd "C-c w w") 'kill-whole-word)

      ;;  Copy whole line
      (defun copy-whole-line ()
        (interactive)
        (save-excursion
          (kill-new
           (buffer-substring
            (point-at-bol)
            (point-at-eol)))))
      (global-set-key (kbd "C-c w l") 'copy-whole-line)
      ;;Kill all buffers
      (defun kill-all-buffers ()
        (interactive)
        (mapc 'kill-buffer (buffer-list)))
      (global-set-key (kbd "C-M-s-k") 'kill-all-buffers)

      ;; comment and un comment
      ;; Comment and uncomment region with C-c c and C-c u
      (global-set-key (kbd "C-c c") 'comment-region)
      (global-set-key (kbd "C-c u") 'uncomment-region)

      ;; Optional: Use C-; to comment/uncomment
      (global-set-key (kbd "C-;") 'comment-line)
      ;; fixed backward word del

      (defun my/backward-kill-spaces-or-char-or-word ()
        (interactive)
        (cond
         ((looking-back (rx (char word)) 1)
          (backward-kill-word 1))
         ((looking-back (rx (char blank)) 1)
          (delete-horizontal-space t))
         (t
          (backward-delete-char 1))))
      (global-set-key (kbd "<C-backspace>") 'my/backward-kill-spaces-or-char-or-word)

#+END_SRC

* Magit & git tools
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :config
    (setq magit-push-always-verify nil)
    (setq git-commit-summary-max-length 50)
    :bind
    ;; ("C-c g g" . magit-status))
    ("C-c g g" . my/magit-status))

  ;; opens magit in full window rather then popup
  (defun my/magit-status ()
  "Don't split window."
  (interactive)
  (let ((pop-up-windows nil))
    (call-interactively 'magit-status)))
#+END_SRC
** diff-hl 
#+begin_src emacs-lisp
  (use-package diff-hl
    :ensure t
    :config
    (global-diff-hl-mode)
    (diff-hl-dired-mode 'toggle))
#+end_src
* Dev
** lsp-mode
to add more lang support you just need to add to hook ex below

(python-mode . lsp)       ;; Add for Python
(js-mode . lsp)           ;; Add for JavaScript
(typescript-mode . lsp)   ;; Add for TypeScript
*** A guide on disabling/enabling lsp-mode features
- https://emacs-lsp.github.io/lsp-mode/tutorials/how-to-turn-off/

=dont forget to install the lang locally and install emacs package for the lang=
#+begin_src emacs-lisp
  ;; Set up hooks for the various programming modes
;;  (add-hook 'c-mode-hook 'lsp-deferred)
;;  (add-hook 'python-mode-hook 'lsp-deferred)
;;  (add-hook 'c++-mode-hook 'lsp-deferred)
;;    ;; Disable corfu 
  (add-hook 'python-mode-hook (lambda () (corfu-mode -1)))
  (add-hook 'c-mode-hook (lambda () (corfu-mode -1)))
  (add-hook 'c++-mode-hook (lambda () (corfu-mode -1)))
;;
;;        (use-package lsp-mode
;;          :ensure t
;;          :commands lsp
;;          :config
;;          (setq lsp-prefer-flymake nil
;;                lsp-idle-delay 0.0)
;;          (setq lsp-headerline-breadcrumb-enable nil)
;;
;;          ;; Enable additional modes and integrations in hooks
;;          (add-hook 'lsp-mode-hook 'lsp-ui-mode)
;;          (add-hook 'lsp-mode-hook 'lsp-enable-which-key-integration))
;;
;;        (global-unset-key (kbd "C-l"))  ; Unbind C-l in global map
;;        (setq lsp-keymap-prefix "C-l")   ; Set custom keymap prefix
;;
;;
;;        ;; (use-package lsp-ui
;;          ;; :ensure t
;;          ;; :config
;;          ;; (setq lsp-ui-sideline-enable t
;;                ;; lsp-ui-doc-enable t
;;                ;; lsp-ui-doc-delay 0.4
;;                ;; lsp-ui-doc-show t
;;                ;; lsp-ui-doc-show-with-cursor nil
;;                ;; lsp-ui-doc-use-childframe t
;;                ;; lsp-ui-peek-enable t
;;                ;; lsp-ui-peek-show-directory t))
;;
;;        ;; You may remap xref-find-{definitions,references} (bound to M-. M-? by default):
;;        ;; (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
;;        ;; (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
;;
;;        (use-package company
;;          :ensure t
;;          :after (lsp-mode company-yasnippet)
;;          :config
;;  	(add-hook 'after-init-hook 'global-company-mode)
;;          (add-hook 'lsp-mode-hook 'company-mode)
;;          (setq company-backends '((company-capf company-yasnippet))))  ; Add yasnippet to company backends
;;
;;    ;; (use-package company-box
;;      ;; :ensure t
;;      ;; :hook (company-mode . company-box-mode))
;;
;;    (use-package yasnippet
;;          :ensure t
;;          :config
;;          (yas-reload-all)
;;          (add-hook 'prog-mode-hook 'yas-minor-mode)
;;          (add-hook 'text-mode-hook 'yas-minor-mode))
;;        (yas-global-mode 1)  ; Enable yasnippet
;;        (use-package yasnippet-snippets
;;        :ensure t)
#+end_src
* eglot 
#+begin_src emacs-lisp
  (use-package eglot
    :ensure t
    :commands (eglot))

;;  (add-hook 'python-mode-hook 'eglot-ensure)   ;; Python
;;  (add-hook 'c-mode-hook 'eglot-ensure)        ;; C
  (add-hook 'c++-mode-hook 'eglot-ensure)      ;; C++

  (use-package company
    :ensure t
    :config
    (add-hook 'eglot-managed-mode-hook 'company-mode)
    (add-hook 'after-init-hook 'global-company-mode)) ;; TODO 

  (defvar eglot-prefix-map (make-sparse-keymap)
    "Keymap for Eglot commands.")

  ;; Bind eglot commands to your desired prefix
  (define-key eglot-prefix-map (kbd "d") 'eglot-find-definition)      ;; C-l d for definition
  (define-key eglot-prefix-map (kbd "r") 'eglot-find-reference)       ;; C-l r for references
  (define-key eglot-prefix-map (kbd "t") 'eglot-find-type-definition) ;; C-l t for type definition
  (define-key eglot-prefix-map (kbd "d") 'flymake-show-buffer-diagnostics) ;; C-l t for type definition


  ;; Now bind the prefix key globally
  (global-set-key (kbd "C-l") eglot-prefix-map)

  ;; (fringe-mode 4)


  ;; Disable corfu in python-mode
  ;; (add-hook 'python-mode-hook (lambda () (corfu-mode -1)))
#+end_src
** lsp for shell scripting 
#+begin_src emacs-lisp
  (use-package sh-script
    :hook
    (sh-mode . flymake-mode)
    (sh-mode . lsp-mode)) ;; optioinal
#+end_src
** wk-mode for whick-key for window manager
#+BEGIN_SRC emacs-lisp
(use-package wks-mode
  :load-path ("~/.emacs.d/manual/"))
#+end_src
* python
- https://stackoverflow.com/questions/38535499/how-to-setup-emacs-to-use-a-given-python-virtualenv
- https://slinkp.com/python-emacs-lsp-20231229.html -- IN Archive Link 
   https://web.archive.org/web/20241106200646/https://slinkp.com/python-emacs-lsp-20231229.html
- [[https://gist.github.com/widdowquinn/987164746810f4e8b88402628b387d39][Turning emacs into a Python IDE]]

**** app to install
=$ sudo nala install direnv=
#+begin_src emacs-lisp
   (use-package elpy
     :ensure t
     :init
     (elpy-enable))

  ;; (use-package envrc
  ;;     :ensure t
  ;;     :config (envrc-global-mode 1))

     ;; sudo nala install pipx
     ;; pipx install 'python-lsp-server[all]'

     ;; pipx install ruff
     ;; pipx install pylsp
     ;; pipx install pyls
#+end_src
#+BEGIN_SRC 
Installing the LSP server and related tools for each project
I haven't automated this for new projects, but a basic recipe to start a new Python project would look something like:

mkdir my-new-project
cd my-new-project
git init .

# Set it up for direnv
echo "layout python3" > .envrc
direnv allow
# Congrats, you now have a virtual python 3 environment in .direnv/python-3.11
# and it's active already!
# You probably want to git ignore those.

# Now we need our python packages:
pip install python-lsp-server pylsp-mypy flake8

#+end_src
* fixs
#+BEGIN_SRC emacs-lisp
  (use-package ansi-color
    :ensure t
    :init
    (defun my-compilation-filter ()
      (ansi-color-apply-on-region (point-min) (point-max)))
    :hook (compilation-filter . my-compilation-filter))
#+END_SRC

** use bash instead of other shells
#+BEGIN_SRC emacs-lisp
  (setq explicit-shell-file-name "/usr/bin/fish")
  (setq explicit-bash-args '("--login" "-i"))
  (setq term-shell "/usr/bin/fish")
  (setq shell-file-name "/usr/bin/fish")
#+END_SRC

* Note Taking
** Denote
