config.el

;; (use-package multiple-cursors
;;   :ensure t)
;; (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
;; (global-set-key (kbd "C->")         'mc/mark-next-like-this)
;; (global-set-key (kbd "C-<")         'mc/mark-previous-like-this)
;; (global-set-key (kbd "C-c C-<")     'mc/mark-all-like-this)
;; (global-set-key (kbd "C-\"")        'mc/skip-to-next-like-this)
;; (global-set-key (kbd "C-:")         'mc/skip-to-previous-like-this)
(global-set-key (kbd "C-c v")         'set-rectangular-region-anchor)

;; Bind `previous-buffer` globally
;; Bind `next-buffer` globally
(global-set-key [mouse-9] #'next-buffer)
(global-set-key [mouse-8] #'previous-buffer)
(global-set-key (kbd "M-.") 'next-buffer)
(global-set-key (kbd "M-,") 'previous-buffer)


;; remap redo from C-M-_ to  C-x U 
(global-set-key (kbd "C-x U") 'undo-redo)

;; Visiting the configuration
(defun config-visit ()
  (interactive)
  (find-file "~/.emacs.d/config.org"))
(global-set-key (kbd "C-c e") 'config-visit)

;; Toggle maximize buffer
(defun toggle-maximize-buffer () "Maximize buffer"
       (interactive)
       (if (= 1 (length (window-list)))
  	   (jump-to-register '_)
  	 (progn
  	   (set-register '_ (list (current-window-configuration)))
  	   (delete-other-windows))))
(global-set-key [(super shift return)] 'toggle-maximize-buffer) 

;;Always murder current buffer
(defun kill-curr-buffer ()
  (interactive)
  (kill-buffer (current-buffer)))
(global-set-key (kbd "C-x k") 'kill-curr-buffer)

;;  Kill whole word
(defun kill-whole-word ()
  (interactive)
  (backward-word)
  (kill-word 1))
(global-set-key (kbd "C-c w w") 'kill-whole-word)

;;  Copy whole line
(defun copy-whole-line ()
  (interactive)
  (save-excursion
    (kill-new
     (buffer-substring
      (point-at-bol)
      (point-at-eol)))))
(global-set-key (kbd "C-c w l") 'copy-whole-line)
;;Kill all buffers
(defun kill-all-buffers ()
  (interactive)
  (mapc 'kill-buffer (buffer-list)))
(global-set-key (kbd "C-M-s-k") 'kill-all-buffers)

;; comment and un comment
;; Comment and uncomment region with C-c c and C-c u
(global-set-key (kbd "C-c c") 'comment-region)
(global-set-key (kbd "C-c u") 'uncomment-region)

;; Optional: Use C-; to comment/uncomment
(global-set-key (kbd "C-;") 'comment-line)
;; fixed backward word del

(defun my/backward-kill-spaces-or-char-or-word ()
  (interactive)
  (cond
   ((looking-back (rx (char word)) 1)
    (backward-kill-word 1))
   ((looking-back (rx (char blank)) 1)
    (delete-horizontal-space t))
   (t
    (backward-delete-char 1))))
(global-set-key (kbd "<C-backspace>") 'my/backward-kill-spaces-or-char-or-word)

(use-package magit
  :ensure t
  :config
  (setq magit-push-always-verify nil)
  (setq git-commit-summary-max-length 50)
  :bind
  ;; ("C-c g g" . magit-status))
  ("C-c g g" . my/magit-status))

;; opens magit in full window rather then popup
(defun my/magit-status ()
"Don't split window."
(interactive)
(let ((pop-up-windows nil))
  (call-interactively 'magit-status)))

(use-package diff-hl
  :ensure t
  :config
  (global-diff-hl-mode)
  (diff-hl-dired-mode 'toggle))

(use-package lsp-mode
  :ensure t
  :hook ((c-mode . lsp)
         (c++-mode . lsp))
  :commands lsp
  :config
  (setq lsp-prefer-flymake nil
        lsp-idle-delay 0.0)
  (setq lsp-headerline-breadcrumb-enable nil)

  ;; Enable additional modes and integrations in hooks
  (add-hook 'lsp-mode-hook 'lsp-ui-mode)
  (add-hook 'lsp-mode-hook 'lsp-enable-which-key-integration))

(global-unset-key (kbd "C-l"))  ; Unbind C-l in global map
(setq lsp-keymap-prefix "C-l")   ; Set custom keymap prefix


(use-package lsp-ui
  :ensure t
  :config
  (setq lsp-ui-sideline-enable t
        lsp-ui-doc-enable t
        lsp-ui-doc-delay 0.4
        lsp-ui-doc-show t
        lsp-ui-doc-show-with-cursor nil
        lsp-ui-doc-use-childframe t
        lsp-ui-peek-enable t
        lsp-ui-peek-show-directory t))

;; You may remap xref-find-{definitions,references} (bound to M-. M-? by default):
(define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
(define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)

(use-package company
  :ensure t
  :after (lsp-mode company-yasnippet)
  :config
  (add-hook 'lsp-mode-hook 'company-mode)
  (setq company-backends '((company-capf company-yasnippet))))  ; Add yasnippet to company backends

(use-package yasnippet
  :ensure t
  :config
  (yas-reload-all)
  (add-hook 'prog-mode-hook 'yas-minor-mode)
  (add-hook 'text-mode-hook 'yas-minor-mode))
(yas-global-mode 1)  ; Enable yasnippet
(use-package yasnippet-snippets
:ensure t)

(use-package sh-script
  :hook
  (sh-mode . flymake-mode)
  (sh-mode . lsp-mode))

(use-package wks-mode
  :load-path ("~/.emacs.d/manual/"))

(use-package ansi-color
  :ensure t
  :init
  (defun my-compilation-filter ()
    (ansi-color-apply-on-region (point-min) (point-max)))
  :hook (compilation-filter . my-compilation-filter))

(setq explicit-shell-file-name "/usr/bin/bash")
(setq explicit-bash-args '("--login" "-i"))
(setq term-shell "/usr/bin/bash")
(setq shell-file-name "/usr/bin/bash")
