config.el

(use-package simple-httpd
  :ensure t)

(use-package websocket
  :ensure t)

(use-package org-roam-ui
  :ensure t
  :after org-roam
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
	  org-roam-ui-follow t
	  org-roam-ui-update-on-save t
	  org-roam-ui-open-on-start t))

(with-eval-after-load 'ox-latex
(add-to-list 'org-latex-classes
             '("org-plain-latex"
               "\\documentclass{article}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(use-package jinx  
    :ensure t
    :hook (emacs-startup . global-jinx-mode)
    ;; :hook ((LaTeX-mode . jinx-mode)  
	     ;; (latex-mode . jinx-mode)  
	     ;; (markdown-mode . jinx-mode)  
	     ;; (org-mode . jinx-mode)
	     ;; (text-mode . jinx-mode)
	     ;; )  
    ;; :bind ([remap ispell-word] . jinx-correct)  
   )
;; (add-hook 'emacs-startup-hook #'global-jinx-mode)
  ;; Jinx keybindings
(global-set-key (kbd "C-c s s") 'jinx-correct)
(global-set-key (kbd "C-c s n") 'jinx-next)
(global-set-key (kbd "C-c s p") 'jinx-previous)
(global-set-key (kbd "C-c s l") 'jinx-languages)
(global-set-key (kbd "C-c s a") 'jinx-correct-all)
(global-set-key (kbd "C-c s w") 'jinx-correct-word)
(global-set-key (kbd "C-c s N") 'jinx-correct-nearest)

(use-package visual-fill-column
  :ensure t
  :hook (org-mode . visual-fill-column-mode)
  :custom
  (visual-fill-column-center-text t)
  (visual-fill-column-width 110))

(use-package visual-line-mode
  :ensure nil
  :hook
  (org-mode . visual-line-mode))

(setq redisplay-dont-pause t) ;; Avoid pausing between updates

  (defun my/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'my/display-startup-time)

     ;; Using garbage magic hack.
    (use-package gcmh
      :ensure t
      :config
      (gcmh-mode 1))
   ;; Setting garbage collection threshold
  (setq gc-cons-threshold 402653184  ;; Set to 384MB (402,653,184 bytes)
       gc-cons-percentage 0.6)      ;; Set the proportion of memory to trigger GC

   ;; Profile emacs startup
   (add-hook 'emacs-startup-hook
             (lambda ()
               (message "*** Emacs loaded in %s with %d garbage collections."
                        (format "%.2f seconds"
                                (float-time
                                 (time-subtract after-init-time before-init-time)))
                        gcs-done)))

   ;; Silence compiler warnings as they can be pretty disruptive (setq comp-async-report-warnings-errors nil)

;; (use-package perspective
;;   :ensure t
;;   :bind (("C-x k" . persp-kill-buffer*))
;;   :init
;;   (setq persp-mode-prefix-key (kbd "C-x ,"))  ; Set your desired prefix key
;;   (persp-mode))

;; (use-package consult
;;   :ensure t
;;   :config
;;   ;; Hide the default consult buffer source
;;   (consult-customize consult--source-buffer :hidden t :default nil)

;;   ;; Define the custom source for perspectives
;;   (defvar consult--source-perspective
;;     (list :name     "Perspective"
;;           :narrow   ?s
;;           :category 'buffer
;;           :state    #'consult--buffer-state
;;           :default  t
;;           :items    #'persp-get-buffer-names))

;;   ;; Add the perspective source to consult-buffer-sources
;;   (unless (boundp 'consult-buffer-sources)
;;     (setq consult-buffer-sources '()))  ;; Initialize if not defined
;;   (add-to-list 'consult-buffer-sources consult--source-perspective))

(use-package tab-bar
  :ensure t
  :init
  (setq tab-bar-height 30
        ;; tab-bar-new-tab-choice "*dashboard*"
        tab-bar-show 1
        ;; tab-bar-close-button-show nil
        tab-bar-select-tab-modifiers '(meta) ;; set to alt + 1-9
        tab-bar-tab-hints t)
  :config
  (tab-bar-mode 1)  ; Activate tab bar mode
  (run-at-time "1 sec" nil
               (lambda ()
		 (set-face-attribute 'tab-bar nil :font "Monospace-12")))) ;; set font size for tab-bar-mode

(use-package tabspaces
  :ensure t
  :hook (after-init . tabspaces-mode) ;; use this only if you want the minor-mode loaded at startup. 
  :commands (tabspaces-switch-or-create-workspace
             tabspaces-open-or-create-project-and-workspace)
  :custom
  (tabspaces-use-filtered-buffers-as-default t)
  (tabspaces-default-tab "Default")
  (tabspaces-remove-to-default t)
  (tabspaces-include-buffers '("*scratch*"))
  (tabspaces-initialize-project-with-todo t)
  (tabspaces-todo-file-name "project-todo.org")
  ;; sessions
  (tabspaces-session t)
  (tabspaces-session-auto-restore t)
  (tab-bar-new-tab-choice "*scratch*"))

;; Filter Buffers for Consult-Buffer
(with-eval-after-load 'consult
  ;; hide full buffer list (still available with "b" prefix)
  (consult-customize consult--source-buffer :hidden t :default nil)
  ;; set consult-workspace buffer list
  (defvar consult--source-workspace
    (list :name     "Workspace Buffers"
          :narrow   ?w
          :history  'buffer-name-history
          :category 'buffer
          :state    #'consult--buffer-state
          :default  t
          :items    (lambda () (consult--buffer-query
				:predicate #'tabspaces--local-buffer-p
				:sort 'visibility
				:as #'buffer-name)))

    "Set workspace buffer list for consult-buffer.")
  (add-to-list 'consult-buffer-sources 'consult--source-workspace))
